/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCAI.com ---------------------------------------------*/
/* --- BBS: www.STCAIMCU.com  -----------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* 如果要在程序中使用此代码,请在程序中注明使用了STC的资料及程序            */
/*---------------------------------------------------------------------*/

#ifndef __CAN_H__
#define __CAN_H__

#define	CAN1	0
#define	CAN2	1

#define CANBAUD          0xe0
#define CANDATA          0xe1

//SJW : 重新同步跳跃宽度  0~3
//SAM : 总线电平采样次数  0:采样1次; 1:采样3次
//TSG1: 同步采样段1       0~15
//TSG2: 同步采样段2       1~7 (TSG2 不能设置为0)
//BRP : 波特率分频系数    0~63
//CAN总线波特率=Fclk/((1+(TSG1+1)+(TSG2+1))*(BRP+1)*2)
#define CANBRT(SJW, SAM, TSG1, TSG2, BRP)   (u16)(((SJW << 6) + BRP) + (((SAM << 7) + (TSG2 << 4) + TSG1) << 8))

#define CANBRT_20K          CANBRT(0, 1, 13, 4, 29)     //24000000/((1+14+5)*30*2)=20KHz
#define CANBRT_40K          CANBRT(0, 1, 13, 4, 14)     //24000000/((1+14+5)*15*2)=40KHz
#define CANBRT_50K          CANBRT(0, 1, 5,  2, 23)     //24000000/((1+6+3)*24*2)=50KHz
#define CANBRT_80K          CANBRT(0, 1, 5,  2, 14)     //24000000/((1+6+3)*15*2)=80KHz
#define CANBRT_100K         CANBRT(0, 0, 5,  2, 11)     //24000000/((1+6+3)*12*2)=100KHz
#define CANBRT_125K         CANBRT(0, 0, 2,  1, 15)     //24000000/((1+3+2)*16*2)=125KHz
#define CANBRT_200K         CANBRT(0, 0, 5,  2, 5)      //24000000/((1+6+3)*6*2)=200KHz
#define CANBRT_250K         CANBRT(0, 0, 2,  1, 7)      //24000000/((1+3+2)*8*2)=250KHz
#define CANBRT_400K         CANBRT(0, 0, 5,  2, 2)      //24000000/((1+6+3)*3*2)=400KHz
#define CANBRT_500K         CANBRT(0, 0, 2,  1, 3)      //24000000/((1+3+2)*4*2)=500KHz
#define CANBRT_800K         CANBRT(0, 0, 1,  1, 2)      //24000000/((1+2+2)*3*2)=800KHz
#define CANBRT_1000K        CANBRT(0, 0, 2,  1, 1)      //24000000/((1+3+2)*2*2)=1000KHz

void CanInit();
void CanPolling();
void CanSetBaudrate(u16 brt);

#endif
