/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCAI.com ---------------------------------------------*/
/* --- BBS: www.STCAIMCU.com  -----------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* 如果要在程序中使用此代码,请在程序中注明使用了STC的资料及程序            */
/*---------------------------------------------------------------------*/

#ifndef __USB_DESC_H__
#define __USB_DESC_H__

extern char code DEVICEDESC[18];
extern char code CONFIGDESC[141];
extern char code LANGIDDESC[4];
extern char code MANUFACTDESC[8];
extern char code PRODUCTDESC[30];

extern char code PACKET0[2];
extern char code PACKET1[2];

#endif
