/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCMCU.com --------------------------------------------*/
/* --- Web: www.STCMCUDATA.com  ---------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* 如果要在程序中使用此代码,请在程序中注明使用了STC的资料及程序            */
/*---------------------------------------------------------------------*/

/*************  CANOpen例程说明   **************

    1. 本例程基于STC32G核心转接板（屠龙刀）进行编写测试；
    2. CAN1(P5.0,P5.1)、CAN2(P5.2,P5.3)通过收发器连接到同一个总线上；
    3. 第一次按P5.4(RST)按键，CAN1发送启动命令让节点进入操作状态；
    4. 之后再按P5.4(RST)按键，CAN1发送CANID 0x20F:xx 报文，xx值控制P6口LED灯状态，每按一次按键 xx 加1；
    5. 按板子上P3.2,P3.3,P3.4,P3.5按键，总线可以接收到CANID 0x18F:01，0x18F:02，0x18F:04，0x18F:08报文；
    6. 串口1(P1.6,P1.7)打印报文收发信息。

******************************************/

#include	"Task.h"
#include	"System_init.h"

//========================================================================
// 函数: void	main(void)
// 描述: 主函数程序.
// 参数: None.
// 返回: None.
// 版本: V1.0, 2012-10-22
//========================================================================
void main(void)
{
	WTST = 0;       //设置程序指令延时参数，赋值为0可将CPU执行指令的速度设置为最快
	EAXSFR();       /* 扩展SFR(XFR)访问使能 */
	CKCON = 0;      //提高访问XRAM速度

	SYS_Init();

	while (1)
	{
        Task_Pro_Handler_Callback();
	}
}



